content/posts/Quantum_field_theory_for_economics_and_finance_by_Belal_Baaquie_in_2018.md
+++
title = "Quantum field theory for economics and finance by Belal Baaquie in 2018"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:42-04:00
slug = "Quantum_field_theory_for_economics_and_finance_by_Belal_Baaquie_in_2018"
draft = false
+++

## Author {#author}


### Belal Baaquie was a student of Ken Wilson. As such, his description of renormalization methods may be of particular interest. {#belal-baaquie-was-a-student-of-ken-wilson-dot-as-such-his-description-of-renormalization-methods-may-be-of-particular-interest-dot}


### "Any probability distribution which obeys a condition on correlation functions called reflection positivity leads to a local quantum field theory after Wick rotation to Minkowski spacetime. The operation of renormalization is a specified set of mappings from the space of probability distributions to itself. A quantum field theory is called renormalizable if this mapping has a fixed point which gives a quantum field theory." {#any-probability-distribution-which-obeys-a-condition-on-correlation-functions-called-reflection-positivity-leads-to-a-local-quantum-field-theory-after-wick-rotation-to-minkowski-spacetime-dot-the-operation-of-renormalization-is-a-specified-set-of-mappings-from-the-space-of-probability-distributions-to-itself-dot-a-quantum-field-theory-is-called-renormalizable-if-this-mapping-has-a-fixed-point-which-gives-a-quantum-field-theory-dot}

<!--list-separator-->

-  <https://diigo.com/0gzv7u>


## 1. Synopsis {#1-dot-synopsis}


### Underlying template {#underlying-template}

<!--list-separator-->

-  application of the concepts of quantum field theory to the description of ****indeterminate and random phenomena****, be they ****classical**** or quantum in origin.


### A general view of applications of tools from physics: quantum mathematics {#a-general-view-of-applications-of-tools-from-physics-quantum-mathematics}

<!--list-separator-->

-  Quantum mathematics refers to the system of mathematical concepts that arise in quantum systems – with some of the leading concepts being that of quantum fields, vacuum expectation values, Hamiltonians, state spaces, operators, correlation func\* tions, Feynman path integrals and Lagrangians.1 The interpretation of quantum mathematics, in general, does not have any relation to physics and, instead, needs to reflect the specificity of the domain of inquiry to which quantum mathematics is being applied.


### 1.1 Organization of the book {#1-dot-1-organization-of-the-book}

<!--list-separator-->

-  Chapters 2, 3, 7, 8, 9, and 14-17 cover the primary material from physics independent of the relevant economics and finance material

    <!--list-separator-->

    -  2) Quantum mechanics

    <!--list-separator-->

    -  3) Classical field theory

    <!--list-separator-->

    -  7) Scalar fields

    <!--list-separator-->

    -  8) Spinor fields

    <!--list-separator-->

    -  9) Photon fields

    <!--list-separator-->

    -  14) Nonlinear scalar fields

    <!--list-separator-->

    -  15) Renormalization

    <!--list-separator-->

    -  16) \\[\beta\\]-function

    <!--list-separator-->

    -  17) Renormalization group


### 1.2 What is a quantum field {#1-dot-2-what-is-a-quantum-field}


## Part I: Introduction {#part-i-introduction}


### ****2. Quantum mechanics**** {#2-dot-quantum-mechanics}

<!--list-separator-->

-  2.1 Introduction

    <!--list-separator-->

    -  all applications to economics and finance considered in this book are based on the view that stochastic and random phenomena in economics and finance are described by <span class="underline"><span class="underline">classical probability theory</span></span>; quantum mathematics is employed solely as a powerful computational tool for addressing these problems.

    <!--list-separator-->

    -

<!--list-separator-->

-  2.2 Quantum principles

    <!--list-separator-->

    -  all physical systems are constituted by degrees of freedom that are fundamentally indeterminate.

<!--list-separator-->

-  2.3 Theory of measurement

<!--list-separator-->

-  2.4 Dirac delta function

<!--list-separator-->

-  2.5 Schrodinger and Heisenberg formalism

<!--list-separator-->

-  2.6 Feynman path integral

<!--list-separator-->

-  2.7 Hamiltonian and path integral

<!--list-separator-->

-  2.8 Hamiltonian from Lagrangian

<!--list-separator-->

-  2.9 Summary

<!--list-separator-->

-  Appendices

    <!--list-separator-->

    -  2.10 Diract bracket and vector notation

    <!--list-separator-->

    -  2.11 Gaussian integration

        <!--list-separator-->

        -  2.11.1 Quadratic action

        <!--list-separator-->

        -  2.11.2 Gaussian white noise


### ****3. Classical field theory**** {#3-dot-classical-field-theory}


### 4. Acceleration action {#4-dot-acceleration-action}


### 5. Option theory {#5-dot-option-theory}


### 6. Path integral of asset prices {#6-dot-path-integral-of-asset-prices}


## Part II: Linear quantum fields {#part-ii-linear-quantum-fields}


### ****7. Scalar quantum field**** {#7-dot-scalar-quantum-field}


### ****8. Dirac spinor field**** {#8-dot-dirac-spinor-field}


### ****9. Photon gauge field**** {#9-dot-photon-gauge-field}


### 10. Forward interest rates quantum field {#10-dot-forward-interest-rates-quantum-field}


### 11. Risky interest rates quantum fields {#11-dot-risky-interest-rates-quantum-fields}


### 12. Bonds: index-linked stochastic coupons {#12-dot-bonds-index-linked-stochastic-coupons}


## Part III: Nonlinear quantum fields {#part-iii-nonlinear-quantum-fields}


### 13. Operator expectation and S matrix {#13-dot-operator-expectation-and-s-matrix}


### ****14. Nonlinear scalar field: Feynman diagrams**** {#14-dot-nonlinear-scalar-field-feynman-diagrams}


### ****15. Renormalization**** {#15-dot-renormalization}

<!--list-separator-->

-  15.1 Introduction

<!--list-separator-->

-  15.2 Renormalization schemes

<!--list-separator-->

-  15.3 Bare perturbation theory

<!--list-separator-->

-  15.4 Mass and field renormalization

<!--list-separator-->

-  15.5 Minimal subtraction

<!--list-separator-->

-  15.6 Coupling constant renormalization

    <!--list-separator-->

    -  15.6.1 Renormalized massless four-point

<!--list-separator-->

-  15.7 Change of scale \\[\mu\\]

<!--list-separator-->

-  15.8 \\[O(N)\\] symmetric scalar field

<!--list-separator-->

-  15.9 Renormalization constants of \\[\phi^4\\] theory

<!--list-separator-->

-  15.10 Renormalized perturbation theory

<!--list-separator-->

-  15.11 Momentum cutoff regularization

<!--list-separator-->

-  15.12 Background field method

<!--list-separator-->

-  15.13 Wilson renormalization

<!--list-separator-->

-  15.14 Thinning of degrees of freedom

    <!--list-separator-->

    -  15.14.1 What is a quantum field? Revisited

        <!--list-separator-->

        -  Wilson and Kogut 1974; Wilson 1983

        <!--list-separator-->

        -  A quantum field theory prior to having defined a cutoff must be obtained as the limit of a theory with a cutoff. This is independent of perturbation theory [Wilson and Kogut 1974].

        <!--list-separator-->

        -  A quantum field is understood to consist of infinitely many degrees of freedom organized in a connected sequence of changing length scales. The nonlinear terms in the action couple all the momentum scales. There is no characteristic scale that can be singled out thereby allowing for the neglect of or treatment of the other scales as perturbations [Wislon 1983].

        <!--list-separator-->

        -  Action with cutoff \\[\Lambda\\] describes correlation functions at scale \\[\Lambda\\]. The breaking of scale invariance is essential in defining the renormalized theory.

        <!--list-separator-->

        -  All the divergences of quantum fields are rendered finite by comparing two nearby scales

            <!--list-separator-->

            -  renormalization constants arise from describing correlation functions at scale \\[b \Lambda\\] in terms of coupling constants at scale \\[\Lambda\\]

<!--list-separator-->

-  15.15 Renormalizability to all orders

    <!--list-separator-->

    -  15.15.1 \\[\phi^3\\]: super-renormalizable in \\[d=4\\]

<!--list-separator-->

-  15.16 Superficial degree of divergence

<!--list-separator-->

-  15.17 Summary


### ****16.**** \\[\beta\\]\*\*-function; fixed points\*\* {#16-dot-beta-function-fixed-points}


### ****17. Renormalization group and phase transitions**** {#17-dot-renormalization-group-and-phase-transitions}


### 18. Effective action {#18-dot-effective-action}


### 19. Nonlinear interest rates quantum field {#19-dot-nonlinear-interest-rates-quantum-field}


### 20. Simulation of nonlinear interest rates {#20-dot-simulation-of-nonlinear-interest-rates}


### 21. Interest rate range accrual swap {#21-dot-interest-rate-range-accrual-swap}


## Part IV: Two-dimensional quantum fields {#part-iv-two-dimensional-quantum-fields}


### 22. Two-dimensional quantum electrodynamics {#22-dot-two-dimensional-quantum-electrodynamics}


### 23. Bosonic string theory {#23-dot-bosonic-string-theory}
